Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: It is implicitly declared simply by its inclusion in the loop declaration, without the need for a let declaration keyword.
ja: それはループ宣言にひっくるめることによって、let宣言キーワードの必要なしで、簡易に暗黙のうちに宣言されます。

source: It is important to consider each operator’s precedence and associativity when working out the order in which a compound expression will be calculated.
ja: 複合の式が計算される順番を解決するとき、各演算子の優先順位と結合性を考慮することは、重要です。

source: It is not appropriate to set threeTimesTable[someIndex] to a new value, and so the subscript for TimesTable is defined as a read-only subscript.
ja: threeTimesTable[someIndex]を新しい値に設定することは適切ではありません、なのでTimesTableのための添え字は、読み出し専用の添え字として定義されます。

source: It is not strictly necessary to use the gameLoop label when calling continue gameLoop to jump to the next iteration of the loop.
ja: ループの次の繰り返しへジャンプするためにcontinue gameLoopを呼ぶとき、gameLoopラベルを使用することは厳密には必要ではありません。

source: It is not valid to write the following code, because the first case is empty:
ja: 最初のケース節が空であるので、以下のコードを書くことは、有効ではありません：

source: It is often useful to execute different pieces of code based on certain conditions.
ja: 特定の状況に基づいて異なるコード小片を実行することは、しばしば役に立ちます。

source: It is possible for a DataManager instance to manage its data without ever importing data from a file, so there is no need to create a new DataImporter instance when the DataManager itself is created.
ja: DataManagerインスタンスがそれのもつデータを管理することはデータをファイルから一度もインポートしなくとも可能ですので、DataManager自体がつくられるときに、新しいDataImporterインスタンスをつくる必要はありません。

source: It is sometimes useful to define a class, structure, or enumeration for which initialization can fail.
ja: それに対するイニシャライザが失敗できるクラス、構造体、または列挙を定義することは時として便利です。

source: It is then incremented by 1 using the overflow addition operator (&+).
ja: それは、それからオーバフロー加算演算子（&+）を使って1だけ増やされます。

source: It is therefore appropriate to write this initializer as init(_ celsius: Double) so that it can be called by providing an unnamed Double value.
ja: したがって、適切なのはこのイニシャライザをinit(_ celsius: Double)のように書くことであり、それによってそれは名前のないDouble値を提供することで呼び出されることができます。

source: It isn’t possible to overload the default assignment operator (=).
ja: もとからある代入演算子（=）をオーバーロードすることは不可能です。

source: It iterates over the items in the container to add them up, and divides by the container’s count to compute the average.
ja: それは、コンテナの中の項目すべてにわたって繰り返していき、それらを合計します、そしてコンテナの総数で除算することで平均を計算します。

source: It lets you write the code that’s typically executed without wrapping it in an else block, and it lets you keep the code that handles a violated requirement next to the requirement.
ja: それはあなたにコードをそれが概ねelseブロックの内にそれを包み込むことなしに実行されるように書かせて、尚且つそれはあなたにコードをそれがある破られた要件から次の要件を取り扱うように保ったままにさせます。

source: It makes for shorter, clearer initializers and enables you to infer the type of the property from its default value.
ja: それは、より短い、より明白なイニシャライザを作り、あなたにその省略時の値からプロパティの型を推論するのを可能にします。

source: It may seem an unusual way to represent negative numbers, but it has several advantages.
ja: それは負数を表す普通でない方法のようかもしれません、しかしそれはいくつかの利点を持ちます。

source: It multiplies a starting value of 1 (that is, 3 to the power of 0) by 3, ten times, using a closed range that starts with 1 and ends with 10.
ja: それは開始値の1（すなわち、3の0乗）に3を掛けることを、10回、1から始まり10で終わる完結範囲を使って行います。

source: It must be possible to access a count of the items in the container through a count property that returns an Int value.
ja: コンテナの中の項目の総数にアクセスすることがInt値を返すcountプロパティを通して可能でなければなりません。

source: It must be possible to add a new item to the container with an append(_:) method.
ja: 新しい項目をコンテナに加えることがappend(_:)メソッドで可能でなければなりません。

source: It must be possible to retrieve each item in the container with a subscript that takes an Int index value.
ja: コンテナの中の各項目を取り出すことがIntインデックス値をとる添え字で可能でなければなりません。

source: It provides a gettable dice property and a play() method in order to conform to the protocol.
ja: それは、プロトコルに従うために取得可能なdiceプロパティとplay()メソッドを提供します。

source: It reserves the flexibility to return values of multiple types:
ja: それは複数の型の値を返す柔軟性を確保します：

source: It resets a numberOfTurns property to zero when the game starts, increments it each time a new turn begins, and prints out the total number of turns once the game has ended.
ja: それは、ゲームが始まるときnumberOfTurnsプロパティをゼロに再設定します、新しいターンが開始するときそれぞれそれを増加させます、そしてひとたびゲームが終わってしまったならばターンの総数を出力します。

source: It returns true if the expression can be cast to the specified type; otherwise, it returns false.
ja: それは、式が指定された型へキャストできるならばtrueを返します；そうでなければfalseを返します。

source: It returns a new number whose bits are set to 1 only if the bits were equal to 1 in both input numbers:
ja: それはある新しい数を返します、それのビットは両方の入力数においてビットが1と等しかった場合にだけ1に設定されます：

source: It returns an integer value to indicate the actual number of coins that were provided.
ja: それは、提供されたコインの実際の数を示す整数値を返します。

source: It returns either the enumeration case matching the raw value or nil if there is no matching Rank.
ja: それは、その生の値に合致する列挙ケース節、または合致するRankがないならばnilのどちらかを返します。

source: It says “I am done with the current loop iteration” without leaving the loop altogether.
ja: それは、そのループをすっかり止めてしまわずに「私は、現在のループ繰り返しを終えた」と言います。

source: It starts by calculating an appropriate origin point based on a center point and a size value.
ja: それは、center地点とsize値に基づいて適切な原点を計算することによって始まります。

source: It starts with an initial value of 0.
ja: それは、初期値の0から始めます。

source: It states that it adopts the FullyNamed protocol as part of the first line of its definition.
ja: それは、その定義の最初の行の部分でそれがFullyNamedプロトコルを採用すると述べます。

source: It then calls (or delegates) to the init(origin:size:) initializer, which stores the new origin and size values in the appropriate properties:
ja: それは、それからinit(origin:size:)イニシャライザに呼び出し（または委任）をします、それは、新しい原点とサイズ値を適切なプロパティに格納します：

source: It then calls a designated initializer on its superclass to continue the initialization up the chain.
ja: それはそれから、連鎖を上って初期化を続けるために、そのスーパークラス上で指定イニシャライザを呼びます。

source: It then continues to repeat the loop until the condition is false.
ja: それはそれから、条件がfalseになるまでループを繰り返し続けます。

source: It then declares a variable called cinema and sets it to the current value of hd.
ja: それは、それからcinemaと呼ばれる変数を宣言して、それをhdの現在の値に設定します。

source: It then executes an appropriate block of code, based on the first pattern that matches successfully.
ja: それはそれから、うまく合う最初のパターンに基づいて、適切なコードのブロックを実行します。

source: It then iterates through the array of board squares, and appends a geometric shape to represent the contents of each square:
ja: それは、それからボードの正方形の配列の端から端まで繰り返して、ある幾何学形を各正方形の内容を表わすために追加します：

source: It then uses the fallthrough keyword to “fall into” the default case as well.
ja: それはそれからfallthroughキーワードを使って、defaultケース節にもまた「落ちていく」ようにします。

source: It uses an instance property called currentLevel to track the level that a player is currently playing.
ja: それはcurrentLevelと呼ばれるインスタンスプロパティをプレーヤーが現在プレイしているレベルを追跡するために使います。

source: It uses special values for jack, queen, king, and ace.
ja: それは、jack、queen、king、そしてaceのために特別な値を使います。

source: It uses these methods to keep track of the number of turns a game has taken.
ja: それは、あるゲームがとったターンの数の情報を得続けるためにこれらのメソッドを使用します。

source: It would be much more useful to define a generic Stack class, that can manage a stack of any type of value.
ja: それをもっと役に立つようにするには、総称体Stackクラスを定義することです、それはあらゆる型の値のスタックを管理することができるものです。

source: Iterating Over a Dictionary
ja: 辞書じゅうを繰り返す

source: Iterating Over a Set
ja: 集合全体を繰り返す

source: Iterating Over an Array
ja: 配列じゅうを繰り返す

source: Iterating over Enumeration Cases
ja: 列挙ケース節の全てにわたって反復する

source: Its combination of safety and speed make Swift an excellent choice for everything from “Hello, world!” to an entire operating system.
ja: その安全とスピードの連携は、スウィフトを「Hello, world!」からオペレーティングシステム全体までのあらゆることに対する素晴らしい選択とします。

source: Its conciseness can lead to hard-to-read code if overused.
ja: その簡潔さは、濫用されるならば、読み辛いコードに至る可能性があります。

source: Its keys are of type Int, and its values are of type String.
ja: そのキーはInt型です、そしてその値はString型です。

source: Its parameters are then implicitly named $ followed by their position: $0, $1, $2, and so on.
ja: そのパラメータは、それから暗黙のうちに$の後にそれらの位置が続く名前：$0、$1、$2、などをつけられます。

source: Its size is based on a constant called finalSquare, which is used to initialize the array and also to check for a win condition later in the example.
ja: その大きさはfinalSquareと呼ばれる定数に基づきます、そして、それがこの配列を初期化して、さらにこの例の後半で勝利したかどうか調べるために使われます。

source: It’s a compile-time error to override a method without the override modifier or to use the override modifier on a method that doesn’t override a superclass method.
ja: override宣言修飾子なしでメソッドをオーバーライドするか、スーパークラスメソッドをオーバーライドしないメソッドでoverride宣言修飾子を使用することは、コンパイル時エラーです。

source: It’s a compile-time error to write a structure or enumeration definition that tries to adopt SomeClassOnlyProtocol.
ja: SomeClassOnlyProtocolを採用しようと試みる構造体や列挙定義を書くことは、コンパイル時エラーになります。

source: It’s a safe, fast, and interactive programming language that combines the best in modern language thinking with wisdom from the wider Apple engineering culture and the diverse contributions from its open-source community.
ja: それは、安全で、高速な、そしてインタラクティブなプログラミング言語であり、現代の言語の最良の思想を、幅広いアップル工学文化由来の知的資産およびそのオープンソース・コミュニティからの多様な貢献と結合するものです。

source: It’s a shortcut for evaluating one of two expressions based on whether question is true or false.
ja: それは、questionが真実であるか間違っているかに基づいて、２つの式のうちの１つを評価することに対する近道です。

source: It’s an industrial-quality programming language that’s as expressive and enjoyable as a scripting language.
ja: それは、スクリプティング言語と同じくらい表現豊かで楽しい、工業品質のプログラミング言語です。

source: It’s applied to a class to indicate that the class can’t be subclassed.
ja: それはクラスに適用されて、そのクラスがサブクラスを作られることができないのを指し示します。

source: It’s applied to a property, method, or subscript of a class to indicate that a class member can’t be overridden in any subclass.
ja: それはプロパティ、メソッド、またはクラスの添え字に適用されて、そのクラスメンバーがあらゆるサブクラスにおいてオーバーライドされることができないのを指し示します。

source: It’s common to call functions that take autoclosures, but it’s not common to implement that kind of function.
ja: 自動クロージャを取る関数を呼び出すのは普通です、しかしそのような関数を実装するのは一般的ではありません。

source: It’s convenient for an inventory tracking system to store UPC barcodes as a tuple of four integers, and QR code barcodes as a string of any length.
ja: UPCバーコードを４つの整数のタプルとして、そしてQRコード・バーコードを任意の長さの文字列として格納できるのは、在庫追跡システムにとって便利です。

source: It’s either an Int, or it’s nothing at all.)
ja: それはひとつのInt、またはそれは全く何も無いかのどちらかです。）

source: It’s even valid for a subclass member to call a superclass member that has lower access permissions than the subclass member, as long as the call to the superclass’s member takes place within an allowed access level context (that is, within the same source file as the superclass for a file-private member call, or within the same module as the superclass for an internal member call):
ja: スーパークラスのメンバーへの呼び出しがある許されるアクセス水準文脈内で（すなわち、ファイル外非公開メンバー呼び出しのためのスーパークラスと同じソースファイル内で、または内部メンバー呼び出しのためのスーパークラスと同じモジュール内で）起こる限り、サブクラスメンバーより低いアクセス許可を持つスーパークラスメンバーを呼び出すことは、サブクラスメンバーにとってさえ有効です：

source: It’s more useful, and considerably more flexible, to write a single function that swaps two values of any type.
ja: さらに役に立ち、そしてよりずっと柔軟であるのは、あらゆる型の２つの値を交換できるただ１つの関数を書くことです。

source: It’s not of type Dice, or DiceGame, or Hamster, even if the actual instance behind the scenes is of one of those types.
ja: それは型Dice、またはDiceGame、またはHamsterではありません、たとえ舞台裏の実際のインスタンスがそれらの型のうちの１つであるとしてもです。

source: It’s not valid to mark the definition of someFunction() with the public or internal modifiers, or to use the default setting of internal, because public or internal users of the function might not have appropriate access to the private class used in the function’s return type.
ja: someFunction()の定義がpublicまたはinternalを使って印されること、または省略時設定の内部を使うことは有効ではありません、なぜなら、この関数の公開や内部のユーザーは適切なアクセスを関数の戻り型の中で使われる非公開クラスに対して持たないからです。

source: It’s not valid to write a public property with a private type, for example.
ja: 例えば、非公開の型で公開のプロパティを書くことは、有効ではありません。

source: It’s now possible to iterate over the items in the array, and print each item’s textual description:
ja: 現在この配列の項目の上に繰り返して、各項目のもつ説明テキストを出力することが可能です：

source: It’s possible that the dice roll may have moved the player beyond square 25, in which case the game is over.
ja: さいころを振ることが正方形25を越えてプレーヤーを動かす可能性はあり得ます、その場合にはゲームは終了です。

source: It’s rare that you need to write type annotations in practice.
ja: あなたが型注釈を書く必要があることは実際問題として、まれです。

source: It’s said to be half-open because it contains its first value, but not its final value.
ja: それが半開と言われるのは、それがその最初の値を含むけれども、その最後の値は含まないためです。

source: It’s set to be interlaced, its name is set to "1080i", and its frame rate is set to 25.0 frames per second.
ja: それはインターレースされるように設定されます、それの名前は"1080i"に設定されます、そしてそれのフレームレートは25.0フレーム毎秒に設定されます。

source: It’s sometimes necessary for a method to modify (or mutate) the instance it belongs to.
ja: メソッドがそれが属しているインスタンスを修正する（または変化させる）ことは、時々必要です。

source: It’s sometimes useful to include parentheses when they’re not strictly needed, to make the intention of a complex expression easier to read.
ja: 複雑な式をより簡単に読めるようにするため、丸括弧をそれらが厳密には必要とされないとき含むことは、時々役に立ちます。

source: It’s the frameRate property of the underlying VideoMode that is changed, not the values of the constant references to that VideoMode.
ja: それは、根底にあるVideoModeのframeRateプロパティです、それは変更可能です、そのVideoModeに対する参照をもつこれら定数の値ではありません。

source: Just before this happens, its deinitializer is called automatically, and its coins are returned to the bank.
ja: これが起こる直前に、そのデイニシャライザは自動的に呼ばれます、そしてそのコインは胴元に返されます。

source: Just like functions and methods, initializers can throw or rethrow errors.
ja: 関数やメソッドのように、イニシャライザはエラーをスローまたは再スローできます。

source: Just like when you include a value on both sides, the final value isn’t part of the range.
ja: ちょうどあなたが両方の側で１つの値を含める場合のように、最後の値はその範囲の一部分ではありません。

source: Keeping the sign bit the same during this shift means that negative integers remain negative as their value moves closer to zero.
ja: このシフトの間に符号ビットを同じに保つことは、それの値がゼロの近くに動くとき、負整数が負のままであることを意味します。

source: Key-Path Expression
ja: キーパス式

source: Key-Path String Expression
ja: キーパス文字列式

source: Keywords and Punctuation
ja: キーワードと句読点

source: Keywords other than inout, var, and let can be used as parameter names in a function declaration or function call without being escaped with backticks.
ja: inout、var、そしてlet以外のキーワードは、パラメータ名として関数宣言または関数呼び出しにおいてバッククォートでエスケープされることなく使われることができます。

source: Keywords reserved in particular contexts: associativity, convenience, dynamic, didSet, final, get, infix, indirect, lazy, left, mutating, none, nonmutating, optional, override, postfix, precedence, prefix, Protocol, required, right, set, Type, unowned, weak, and willSet.
ja: 特定の前後関係において予約されるキーワード：associativity, convenience, dynamic, didSet, final, get, infix, indirect, lazy, left, mutating, none, nonmutating, optional, override, postfix, precedence, prefix, Protocol, required, right, set, Type, unowned, weak, そしてwillSet。

source: Keywords that begin with a number sign (#): #available, #colorLiteral, #column, #else, #elseif, #endif, #error, #file, #fileLiteral, #function, #if, #imageLiteral, #line, #selector, #sourceLocation, and #warning.
ja: シャープ記号（#）で始まるキーワード：#available, #colorLiteral, #column, #else, #elseif, #endif, #error, #file, #fileLiteral, #function, #if, #imageLiteral, #line, #selector, #sourceLocation, そして #warning。

source: Keywords used in declarations: associatedtype, class, deinit, enum, extension, fileprivate, func, import, init, inout, internal, let, open, operator, private, protocol, public, rethrows, static, struct, subscript, typealias, and var.
ja: 宣言において使用されるキーワード：associatedtype, class, deinit, enum, extension, fileprivate, func, import, init, inout, internal, let, open, operator, private, protocol, public, rethrows, static, struct, subscript, typealias, そしてvar。

source: Keywords used in expressions and types: as, Any, catch, false, is, nil, super, self, Self, throw, throws, true, and try.
ja: 式と型において使用されるキーワード：as, Any, catch, false, is, nil, super, self, Self, throw, throws, true, そしてtry。

source: Keywords used in patterns: _.
ja: パターンにおいて使用されるキーワード：_。

source: Keywords used in statements: break, case, continue, default, defer, do, else, fallthrough, for, guard, if, in, repeat, return, switch, where, and while.
ja: 文において使用されるキーワード：break, case, continue, default, defer, do, else, fallthrough, for, guard, if, in, repeat, return, switch, where, そしてwhile。

source: Labeled Statement
ja: ラベルをつけられた文

source: Labeled Statements
ja: ラベルをつけられた文

source: Language Guide
ja: 言語ガイド

source: Language Reference
ja: 言語リファレンス

source: Large integer literal initialization expressions are inferred to be of the correct integer type.
ja: 大きな整数リテラル初期化式は、正しい整数型のものであるように推論されます。

source: Lazy Stored Properties
ja: 遅延格納プロパティ

source: Lazy properties are also useful when the initial value for a property requires complex or computationally expensive setup that should not be performed unless or until it is needed.
ja: 遅延プロパティはまた、プロパティのための最初の値が、それが必要でないなら、あるいは必要になるまで、実行されるべきではない複雑なまたはコンピュータ処理的に高くつく準備を必要とするときに役に立ちます。

source: Lazy properties are useful when the initial value for a property is dependent on outside factors whose values are not known until after an instance’s initialization is complete.
ja: 遅延プロパティが役に立つのは、プロパティのための最初の値がインスタンスの初期化が終了する後まで値が知られない外部の要因に依存しているときです。

source: Less than (a < b)
ja: より小さい、未満 (a < b)

source: Less than or equal to (a <= b)
ja: より小さいか等しい、以下 (a <= b)

source: Lexical Structure
ja: 語彙の構造

source: Like C, Swift has only one ternary operator, the ternary conditional operator (a ? b : c).
ja: Cのように、スウィフトはただ１つの三項演算子、三項条件演算子（a ? b : c）だけをもちます。

source: Like C, Swift provides compound assignment operators that combine assignment (=) with another operation.
ja: Cのように、スウィフトは複合代入演算子を提供します、それは、代入（=）を別の演算と組み合わせます。

source: Like C, Swift uses variables to store and refer to values by an identifying name.
ja: Cのように、スウィフトはひとつの識別名によっていろいろな値を保管したり引用したりするために、変数を使います。

source: Like a switch statement, the compiler attempts to infer whether catch clauses are exhaustive.
ja: switch文のように、コンパイラはcatch節が網羅的であるか推論を試みます。

source: Like a function declaration, a closure contains statements, and it captures constants and variables from its enclosing scope.
ja: 関数宣言の様に、クロージャはいくつかの文を含みます、そしてそれは、定数と変数をそれの取り囲むスコープからキャプチャします。

source: Like a function, an initializer can be used as a value.
ja: 関数のように、イニシャライザは値として使われることができます。

source: Like a weak reference, an unowned reference does not keep a strong hold on the instance it refers to.
ja: 弱い参照のように、非所有参照は、それが言及するインスタンスに対する強い支配力を保ちません。

source: Like a weak reference, the type of the property or value must be a class type; unlike a weak reference, the type is non-optional.
ja: 弱い参照のように、プロパティや値の型はクラス型でなければなりません；弱い参照と違って、その型は非オプショナルです。

source: Like all types in Swift, these integer types have capitalized names.
ja: スウィフトにおける全ての型のように、これらの整数型は頭文字を使った名前を持ちます。

source: Like classes and all other named types, enumerations can have methods associated with them.
ja: クラスや全ての他の名前をつけられた型のように、列挙はそれと結びつけられるメソッドを持つことができます。

source: Like functions, subscripts can take a varying number of parameters and provide default values for their parameters, as discussed in Variadic Parameters and Default Parameter Values.
ja: 関数のように、添え字は可変数のパラメータを取りそしてそれらのパラメータに対して省略時の値を提供できます、可変長パラメータおよび省略時のパラメータ値で議論されるように。

source: Like other types in Swift, their names (such as CompassPoint and Planet) start with a capital letter.
ja: スウィフトにおける他の型のように、それらの名前（例えばCompassPointおよびPlanet）は、大文字から始まります。

source: Like strings, each substring has a region of memory where the characters that make up the substring are stored.
ja: 文字列のように、下位文字列それぞれはメモリのある領域を持ち、そこで下位文字列を作り上げる文字が格納されます。

source: Like structures but unlike classes, enumerations are value types; instances of an enumeration are copied when assigned to variables or constants, or when passed as arguments to a function call.
ja: 構造体のように、しかしクラスとは違い、列挙は値型です；列挙のインスタンスは、変数や定数に代入されるとき、または関数呼び出しに引数として渡されるときにコピーされます。

source: Like the public access level modifier, this attribute exposes the declaration as part of the module’s public interface.
ja: publicアクセス水準修飾子のように、この属性は宣言をモジュールの公開インターフェイスの一部として露出します。

source: Like the remove(at:) method, removeLast() returns the removed item:
ja: removeAtIndex(_:)メソッドのように、remove(at:)は取り除かれた項目を返します：

source: Like the Logical AND operator above, the Logical OR operator uses short-circuit evaluation to consider its expressions.
ja: 上の論理積演算子のように、論理和演算子はその式を考慮するために短絡評価を使います。

source: Like the body of an if statement, each case is a separate branch of code execution.
ja: if文の本文のように、各caseは別々の分岐のコード実行です。

source: Like the subscript examples above, the updateValue(_:forKey:) method sets a value for a key if none exists, or updates the value if that key already exists.
ja: 上の添え字の例のように、updateValue(_:forKey:)メソッドは、まったく何も存在しないならばあるキーに対して値を設定します、またはキーがすでに存在するならばその値を更新します。

source: Likewise, because Void is a type alias for (), the function type (Void) -> Void is the same as (()) -> ()—a function that takes a single argument that is an empty tuple.
ja: 同様に、Voidが()に対する型エイリアスであることから、関数型(Void) -> Voidは(()) -> () — ただ１つの引数を取りそれが空のタプルである関数、と同じです。

source: Likewise, if any of the structure’s stored properties are file private, the initializer is file private.
ja: 同様に、構造体の持つ格納プロパティのいずれかがファイル外非公開ならば、イニシャライザはファイル外非公開です。

source: Likewise, if you don’t specify a type for a floating-point literal, Swift infers that you want to create a Double:
ja: 同様に、あなたがある浮動小数点リテラルのために型を指定しないならば、スウィフトはあなたがDoubleをつくりたいと推測します：

source: Likewise, if you made a subclass of Location that didn’t conform to the Named protocol, calling beginConcert(in:) with an instance of that type is also invalid.
ja: 同様に、あなたがLocationのサブクラスでNamedプロトコルに準拠しないものを作成したならば、beginConcert(in:)をその型のインスタンスで呼び出すことはまた無効です。

source: Likewise, method and function declarations are written the same way.
ja: さらにまた、メソッドおよび関数の宣言も同じやり方で書かれます。

source: Likewise, the willSet clause is optional when you provide a didSet clause.
ja: 同様に、あなたがdidSet節を提供するとき、willSet節は任意です。

source: Likewise, the failable initializer for Product checks the name value, and the initializer process fails immediately if name is the empty string.
ja: 同じように、Productのための失敗できるイニシャライザは、name値を確認して、nameが空の文字列ならば初期化処理は直ちに失敗します。

source: Likewise, type safety prevents you from accidentally passing an optional String to a piece of code that requires a non-optional String.
ja: さらに、型安全はあなたがうっかりしてオプショナルStringを、非オプショナルStringを要求するコード部分に渡すことを防ぎます。

source: Likewise, you can use SuperClass & ProtocolA instead of declaring a new protocol that is a subclass of SuperClass and conforms to ProtocolA.
ja: 同様に、あなたはSuperClass & ProtocolAを使うことが、SuperClassのサブクラスでProtocolAに準拠する新しいプロトコルを宣言する代わりに行えます。

source: Line Control Statement
ja: 行制御文

source: Line breaks in a multiline string literal are normalized to use the line feed character.
ja: 複数行文字列リテラルの中のラインブレークは、正規化されて、ラインフィード文字を使用します。

# Line feed ( )
source: Line feed (\n)
ja: ラインフィード「字送り文字」（\n）

source: Linking Multiple Levels of Chaining
ja: 連鎖の複数の階層を結ぶ

source: Literal
ja: リテラル

source: Literal Expression
ja: リテラル式

source: Literal words and punctuation are indicated by boldface constant width text and appear only on the right-hand side of a grammar production rule.
ja: リテラルの単語と句読点は、太字体の等幅テキストによって示されて、文法導出規則の右側だけに現れます。

source: Literals
ja: 様々なリテラル

source: Local and global variables can’t use property wrappers.
ja: ローカルおよびグローバル変数は、プロパティラッパーを使用できません。

source: Local constants and variables are never computed lazily.
ja: ローカルな定数と変数は、決して遅延して計算されません。

source: Local variables are variables that are defined within a function, method, or closure context.
ja: ローカル変数は、関数、メソッド、またはクロージャの文脈の範囲内で定義される変数です。

source: Logical AND (a && b)
ja: 論理積（a && b）

source: Logical AND Operator
ja: 論理積演算子

source: Logical NOT (!a)
ja: 論理否定（!a）

source: Logical NOT Operator
ja: 論理否定演算子

source: Logical OR (a || b)
ja: 論理和（a || b）

source: Logical OR Operator
ja: 論理和演算子

source: Logical Operators
ja: 論理演算子

source: Loop Statements
ja: ループ文
